"""Common constants"""
import os


RECOGNIZABLE_SIGNS = {
    "1_17": "Осторожно, возвышение на дороге",
    "1_23": "Осторожно, дети",
    "2_1": "Главная дорога",
    "2_4": "Пожалуйста, уступите дорогу",
    "3_20": "Начало полосы",
    "3_24": "Внимание, ограничение скорости",
    "3_27": "Остановка запрещена",
    "4_1_1": "Движение прямо",
    "4_1_4": "Движение прямо и направо",
    "4_2_1": "Объезд препятствия справа",
    "4_2_3": "Объезд препятствия справа и слева",
    "5_15_1": "Проверьте на какой полосе вы находитесь",
    "5_15_2": "Обратите внимание на движение по полосам",
    "5_15_3": "Однополосное движение переходит в двуполосное",
    "5_15_5": "Конец полосы",
    "5_16": "Автобусная остановка",
    "5_19_1": "Пешеходный переход",
    "5_20": "Внимание, лежачий полицейский",
    "6_4": "Парковка",
    "6_16": "Остановитесь",
    "7_3": "Автозаправка",
}
SIGN_ID_LIST = list(RECOGNIZABLE_SIGNS.keys())

PROJECT_PATH = os.path.dirname(__file__)
FRONTEND_PATH = os.path.join(PROJECT_PATH, "frontend")
TEMPLATES_PATH = os.path.join(FRONTEND_PATH, "templates")
STATIC_PATH = os.path.join(FRONTEND_PATH, "static")
YOLO_PATH = os.path.join(PROJECT_PATH, "models", "yolo.pt")
